In [1]:
import pandas as pd

In [2]:
df=pd.read_csv(r"C:\Users\siris\OneDrive\Desktop\AIML\Book1.csv")
df

   Name  Age         City  Salary
0  John   28     New York   70000
1  Anna   22  Los Angeles   75000
2  Mike   32      Chicago   68000
3  Sara   25        Miami   72000

In [3]:
df.columns

Index(['Name', 'Age', 'City', 'Salary'], dtype='object')

In [4]:
df.shape

(4, 4)

In [5]:
df.size

16

In [6]:
df.head() #gives First Five rows of dataframe

   Name  Age         City  Salary
0  John   28     New York   70000
1  Anna   22  Los Angeles   75000
2  Mike   32      Chicago   68000
3  Sara   25        Miami   72000

In [7]:
df.head(2)

   Name  Age         City  Salary
0  John   28     New York   70000
1  Anna   22  Los Angeles   75000

In [8]:
df.tail(1)

   Name  Age   City  Salary
3  Sara   25  Miami   72000

In [10]:
df.tail(2)

   Name  Age     City  Salary
2  Mike   32  Chicago   68000
3  Sara   25    Miami   72000

In [11]:
df.describe()

             Age        Salary
count   4.000000      4.000000
mean   26.750000  71250.000000
std     4.272002   2986.078811
min    22.000000  68000.000000
25%    24.250000  69500.000000
50%    26.500000  71000.000000
75%    29.000000  72750.000000
max    32.000000  75000.000000

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
 3   Salary  4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 260.0+ bytes

In [13]:
df=pd.read_csv(r"C:\Users\siris\OneDrive\Desktop\AIML\cart.csv")
df

,Order ID,Customer Name,Product,Quantity,Price,Total,Date,City
0,1001,Alice Johnson,Laptop,2,1200,2400,15-01-2024,New York
1,1002,Bob Smith,Smartphone,5,600,3000,17-01-2024,Los Angeles
2,1003,Clara Williams,Tablet,3,450,1350,18-01-2024,Chicago
3,1004,Daniel Brown,Headphones,10,100,1000,19-01-2024,Houston
4,1005,Emma Davis,Smartwatch,4,250,1000,20-01-2024,Miami
5,1006,Frank Harris,Laptop,1,1200,1200,21-01-2024,New York
6,1007,Grace Miller,Smartphone,2,600,1200,22-01-2024,Los Angeles
7,1008,Harry Wilson,Headphones,15,100,1500,23-01-2024,Chicago
8,1009,Ivy Martinez,Tablet,7,450,3150,24-01-2024,Houston
9,1010,Jack Anderson,Smartwatch,8,250,2000,25-01-2024,Miami

In [14]:
df.shape

(10, 8)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order ID       10 non-null     int64
 1   Customer Name  10 non-null     object
 2   Product        10 non-null     object
 3   Quantity       10 non-null     int64
 4   Price          10 non-null     int64
 5   Total          10 non-null     int64
 6   Date           10 non-null     object
 7   City           10 non-null     object
dtypes: int64(4), object(4)
memory usage: 772.0+ bytes

In [16]:
df.describe()

         Order ID   Quantity        Price        Total
count    10.00000  10.000000    10.000000    10.000000
mean   1005.50000   5.700000   520.000000  1780.000000
std       3.02765   4.372896   400.832467   813.155718
min    1001.00000   1.000000   100.000000  1000.000000
25%    1003.25000   2.250000   250.000000  1200.000000
50%    1005.50000   4.500000   450.000000  1425.000000
75%    1007.75000   7.750000   600.000000  2300.000000
max    1010.00000  15.000000  1200.000000  3150.000000

In [17]:
df.size

80